# Напишите ваше решение
x = int(input("число:"))
y = int(input("степень:"))
print(x**y)