# Напишите ваше решение
money = float(input())
tax = money/100*13
full_money = money+tax
print(full_money)